InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтадииКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтадииКомплекта</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыСтадии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омЗадачиПКДСервер/Ext/Module.bsl
Функция НеВыполненыеЗадачиИсполнителя(Исполнитель) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадач.Состояние КАК Состояние,
		|	Задачи_ПКД.Ссылка КАК Задача
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|		ПО Задачи_ПКД.Ссылка = ТаймингЗадач.Задача
		|ГДЕ
		|	Задачи_ПКД.Исполнитель = &Исполнитель
		|	И НЕ Задачи_ПКД.Выполнена";
	
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ВозможностьПеревестиЗадачуВРаботу(Задача, мЗадачиВРаботе, КоличествоЗадачНаПаузе) Экспорт

    Исполнитель = Задача.Исполнитель;
	
	тзНеВыполненыеЗадачи = НеВыполненыеЗадачиИсполнителя(Исполнитель);
	
	стОтбор = Новый Структура("Состояние", Перечисления.СостоянияЗадач.ПриостановкаКонструктором);
	
	КоличествоЗадачНаПаузе = тзНеВыполненыеЗадачи.НайтиСтроки(стОтбор).Количество();
	
	Если КоличествоЗадачНаПаузе = 0 Тогда
	
		Возврат Истина;	
	
	КонецЕсли; 
	
	стОтбор.Состояние = Перечисления.СостоянияЗадач.ВРаботе;
	
	НайденыеСтроки = тзНеВыполненыеЗадачи.НайтиСтроки(стОтбор);
	
	ТекущиеКоличествоЗадачВРаботе = 0;
	
	мЗадачиВРаботе = Новый Массив;
	
	Для каждого х Из НайденыеСтроки Цикл
	
		мЗадачиВРаботе.Добавить(х.Задача);
		ТекущиеКоличествоЗадачВРаботе = ТекущиеКоличествоЗадачВРаботе + 1;
		
	КонецЦикла;
	
	КоличествоЗадачПКДВРаботе = омЗадачиПКДПовтор.ПолучитьКоличествоЗадачПКДВРаботе() - ТекущиеКоличествоЗадачВРаботе;
	
	Если КоличествоЗадачПКДВРаботе >= КоличествоЗадачНаПаузе Тогда
	
		Возврат Истина;	
	
	КонецЕсли;
	
	Возврат Ложь;
	

КонецФункции // ВозможностьПеревестиЗадачуВРаботу() 

Функция ПеревестиЗадачуВРаботу(Задача, Комментарий = "") Экспорт
	
	КоличествоЗадачНаПаузе 	= 0;
	мЗадачиВРаботе 			= Неопределено;
	
	Если ВозможностьПеревестиЗадачуВРаботу(Задача, мЗадачиВРаботе, КоличествоЗадачНаПаузе) Тогда
	
		ИзменитьСтатусЗадач(Задача, мЗадачиВРаботе, Комментарий);
		
		Возврат "";
	
	Иначе
	
		Возврат "Не возможно запустить задачу, так как на паузе находиться " + КоличествоЗадачНаПаузе + " задачи.";	
	
	КонецЕсли;
	
КонецФункции // ПеревестиЗадачуВРаботу()

Процедура ИзменитьСтатусЗадач(Задача, мЗадачиВРаботе, Комментарий)
	
    УИД = Новый УникальныйИдентификатор();
	
	
	
	
КонецПроцедуры

Функция УстановитьСтадиюКомплекта(Задача) Экспорт
	
	стТекущиеСостояние = ТекущиеСостояниеЗадачи(Задача);	
	НоваяСтадия = ПолучитьСтадиюКомплеткаНаОснованииПараметров(стТекущиеСостояние);
	
	Если ЗначениеЗаполнено(НоваяСтадия) Тогда
		
		стПараметры = Новый Структура("Комплект, Конструктор, ТекущаяСтадия", стТекущиеСостояние.ОбъектТЗ, "", НоваяСтадия);
		РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
		
	КонецЕсли;
	
КонецФункции // УстановитьСтадиюКомплетка(Задача)

Функция ПолучитьСтадиюКомплеткаНаОснованииПараметров(стТекущиеСостояние)

	СтадияКомплекта = Справочники.СтадииКомплекта.ПустаяСсылка();
	
	тзСтадии = омЗадачиПКДПовтор.ПолучитьСтадииКомплектов();
	
	стОтбор = Новый Структура("ТипЗадачи, Состояние, Статус"
								, Перечисления.ТипыЗадачКонструирования.ПустаяСсылка()
								, Перечисления.СостоянияЗадач.ПустаяСсылка()
								, стТекущиеСостояние.ТекущийСтатус); 
								
								
    НайденыеСтроки = тзСтадии.НайтиСтроки(стОтбор);
	
	Если НайденыеСтроки.Количество() > 0 Тогда
		Возврат НайденыеСтроки[0].Стадия;	
	КонецЕсли;
	
	стОтбор.ТипЗадачи = стТекущиеСостояние.ТекущийТипЗадачи;
								
    НайденыеСтроки = тзСтадии.НайтиСтроки(стОтбор);
	
	Если НайденыеСтроки.Количество() > 0 Тогда
		Возврат НайденыеСтроки[0].Стадия;	
	КонецЕсли;
	
	стОтбор.Состояние = стТекущиеСостояние.ТекущиеСостояние;
								
    НайденыеСтроки = тзСтадии.НайтиСтроки(стОтбор);
	
	Если НайденыеСтроки.Количество() > 0 Тогда
		Возврат НайденыеСтроки[0].Стадия;	
	КонецЕсли;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
	//Если ЗначениеЗаполнено(стТекущиеСостояние.ТекущийТипЗадачи) И ЗначениеЗаполнено(стТекущиеСостояние.ТекущиеСостояние) 
	//	И ЗначениеЗаполнено(стТекущиеСостояние.ТекущийСтатус) Тогда

	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		|	СтадииКомплекта.Ссылка КАК СтадияКомплекта
	//		|ИЗ
	//		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплекта
	//		|ГДЕ
	//		|	СтадииКомплекта.ТипЗадачи = &ТипЗадачи
	//		|	И СтадииКомплекта.Состояние = &Состояние
	//		|	И СтадииКомплекта.Статус = &Статус";
	//	
	//	Запрос.УстановитьПараметр("ТипЗадачи", 	стТекущиеСостояние.ТекущийТипЗадачи);
	//	Запрос.УстановитьПараметр("Состояние", 	стТекущиеСостояние.ТекущиеСостояние);
	//	Запрос.УстановитьПараметр("Статус", 	стТекущиеСостояние.ТекущийСтатус);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		Возврат Выборка.СтадияКомплекта; 
	//	КонецЦикла;

	//КонецЕсли;
	//
	//Если НЕ (ЗначениеЗаполнено(стТекущиеСостояние.ТекущийТипЗадачи) ИЛИ ЗначениеЗаполнено(стТекущиеСостояние.ТекущиеСостояние)) Тогда

	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		|	СтадииКомплекта.Ссылка КАК СтадияКомплекта
	//		|ИЗ
	//		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплекта
	//		|ГДЕ
	//		|	СтадииКомплекта.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ПустаяСсылка)
	//		|	И СтадииКомплекта.Статус = &Статус
	//		|	И СтадииКомплекта.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка)";
	//	
	//	Запрос.УстановитьПараметр("Статус", 	стТекущиеСостояние.ТекущийСтатус);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		Возврат Выборка.СтадияКомплекта; 
	//	КонецЦикла;

	//КонецЕсли;
	//
	//Если НЕ (ЗначениеЗаполнено(стТекущиеСостояние.ТекущийСтатус) ИЛИ ЗначениеЗаполнено(стТекущиеСостояние.ТекущиеСостояние)) Тогда

	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		|	СтадииКомплекта.Ссылка КАК СтадияКомплекта
	//		|ИЗ
	//		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплекта
	//		|ГДЕ
	//		|	СтадииКомплекта.ТипЗадачи = &ТипЗадачи
	//		|	И СтадииКомплекта.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПустаяСсылка)
	//		|	И СтадииКомплекта.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка)";
	//	
	//	Запрос.УстановитьПараметр("ТипЗадачи", 	стТекущиеСостояние.ТекущийТипЗадачи);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		Возврат Выборка.СтадияКомплекта; 
	//	КонецЦикла;

	//КонецЕсли;
	//
	//Если НЕ (ЗначениеЗаполнено(стТекущиеСостояние.ТекущийСтатус) ИЛИ ЗначениеЗаполнено(стТекущиеСостояние.ТекущийТипЗадачи)) Тогда

	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		|	СтадииКомплекта.Ссылка КАК СтадияКомплекта
	//		|ИЗ
	//		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплекта
	//		|ГДЕ
	//		|	СтадииКомплекта.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ПустаяСсылка)
	//		|	И СтадииКомплекта.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПустаяСсылка)
	//		|	И СтадииКомплекта.Состояние = &Состояние";
	//	
	//	Запрос.УстановитьПараметр("Состояние", 	стТекущиеСостояние.ТекущиеСостояние);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		Возврат Выборка.СтадияКомплекта; 
	//	КонецЦикла;

	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(стТекущиеСостояние.ТекущийТипЗадачи) Тогда

	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		|	СтадииКомплекта.Ссылка КАК СтадияКомплекта
	//		|ИЗ
	//		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплекта
	//		|ГДЕ
	//		|	СтадииКомплекта.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ТипыЗадачКонструирования.ПустаяСсылка)
	//		|	И СтадииКомплекта.Статус = &Статус
	//		|	И СтадииКомплекта.Состояние = &Состояние";
	//	
	//	Запрос.УстановитьПараметр("Состояние", стТекущиеСостояние.ТекущиеСостояние);
	//	Запрос.УстановитьПараметр("Статус", 	стТекущиеСостояние.ТекущийСтатус);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		Возврат Выборка.СтадияКомплекта; 
	//	КонецЦикла;

	//КонецЕсли;
	//
	//
	//Если НЕ ЗначениеЗаполнено(стТекущиеСостояние.ТекущиеСостояние) Тогда

	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		|	СтадииКомплекта.Ссылка КАК СтадияКомплекта
	//		|ИЗ
	//		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплекта
	//		|ГДЕ
	//		|	СтадииКомплекта.ТипЗадачи = &ТипЗадачи
	//		|	И СтадииКомплекта.Статус = &Статус
	//		|	И СтадииКомплекта.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ПустаяСсылка)";
	//		
	//	Запрос.УстановитьПараметр("ТипЗадачи", стТекущиеСостояние.ТекущийТипЗадачи);
	//	Запрос.УстановитьПараметр("Статус", 	стТекущиеСостояние.ТекущийСтатус);
	//		
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		Возврат Выборка.СтадияКомплекта; 
	//	КонецЦикла;

	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(стТекущиеСостояние.ТекущийСтатус) Тогда

	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		|	СтадииКомплекта.Ссылка КАК СтадияКомплекта
	//		|ИЗ
	//		|	Справочник.СтадииКомплекта.РеквизитыСтадии КАК СтадииКомплекта
	//		|ГДЕ
	//		|	СтадииКомплекта.ТипЗадачи = СтадииКомплекта.ТипЗадачи
	//		|	И СтадииКомплекта.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.ПустаяСсылка)
	//		|	И СтадииКомплекта.Состояние = &Состояние";
	//		
	//	Запрос.УстановитьПараметр("ТипЗадачи", стТекущиеСостояние.ТекущийТипЗадачи);
	//	Запрос.УстановитьПараметр("Состояние", 	стТекущиеСостояние.ТекущийСтатус);
	//		
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		Возврат Выборка.СтадияКомплекта; 
	//	КонецЦикла;

	//КонецЕсли;
	//
	//Возврат Справочники.СтадииКомплекта.ПустаяСсылка();

КонецФункции // ПолучитьСтадиюКомплеткаНаОснованииПараметров(Задача)

Функция ТекущиеСостояниеЗадачи(Задача)

	стТекущиеСостояние = Новый Структура("ТекущиеСостояние, ТекущийТипЗадачи, ТекущийСтатус, ОбъектТЗ", );
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ТаймингЗадач.Период) КАК Период
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Задача = &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингЗадач.Состояние КАК ТекущиеСостояние,
		|	ТаймингЗадач.Период КАК Период,
		|	ТаймингЗадач.Задача.ТипЗадачи КАК ТекущийТипЗадачи,
		|	ТаймингЗадач.Задача.ОбъектТЗ КАК ОбъектТЗ,
		|	ТаймингЗадач.Задача.СтатусЗадачи КАК ТекущийСтатус
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ТаймингЗадач.Период = вт.Период
		|ГДЕ
		|	ТаймингЗадач.Задача = &Задача";	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стТекущиеСостояние, Выборка);
	КонецЦикла;
	
	Возврат стТекущиеСостояние;

КонецФункции // ТекущиеСостояниеЗадачи()

Процедура ПроверкаОбобщеннойЗадачи(Задача) Экспорт

    Если ТипЗнч(Задача) = Тип("Массив") Тогда
	
		ПроверитьМассивЗадач(Задача);	
	
	Иначе
	
		ПроверитьЕдинственнуюЗадачу(Задача);	
	
	КонецЕсли;
	

КонецПроцедуры // ПроверкаОбобщеннойЗадачи()

Процедура ПроверитьМассивЗадач(мЗадач, мОбработанныеКомпозиции = Неопределено)
	
	ТипКомпозиция = Тип("СправочникСсылка.Композиции");
	Если мОбработанныеКомпозиции = Неопределено Тогда
		мОбработанныеКомпозиции = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ,
	|	Задачи_ПКД.ОбобщеннаяЗадача КАК ОбобщеннаяЗадача,
	|	Задачи_ПКД.Ссылка КАК Ссылка,
	|	Задачи_ПКД.Композиция КАК Композиция,
	|	ТИПЗНАЧЕНИЯ(Задачи_ПКД.ОбъектТЗ) КАК Тип
	|ИЗ
	|	Задача.Задачи_ПКД КАК Задачи_ПКД
	|ГДЕ
	|	Задачи_ПКД.Ссылка В(&мЗадач)";
	
	Запрос.УстановитьПараметр("мЗадач", мЗадач);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мКомпозиции = Новый Массив;
	мКомплекты 	= Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если ТипКомпозиция = Выборка.Тип Тогда
			
			Если мОбработанныеКомпозиции.Найти(Выборка.ОбъектТЗ) = Неопределено Тогда
				
				мОбработанныеКомпозиции.Добавить(Выборка.ОбъектТЗ);	
				мКомпозиции.Добавить(Выборка.ОбъектТЗ);	
				
			КонецЕсли;
			
		Иначе
			
			мКомплекты.Добавить(Выборка.ОбъектТЗ);	
			
		КонецЕсли;		
	КонецЦикла;
	
	ПроверитьМассивКомпозиций(мКомпозиции, мОбработанныеКомпозиции);
	ПроверитьМассивКомплектов(мКомплекты);
	
КонецПроцедуры

Процедура ПроверитьМассивКомплектов(мКомплекты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задача
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&мКомплекты)) КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	НЕ ДанныеКомплектаСрезПоследних.Конструктор = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|	И (ДанныеКомплектаСрезПоследних.Конструктор = ДанныеКомплектаСрезПоследних.Конструктор
		|				И НЕ Задачи_ПКД.ОбобщеннаяЗадача
		|			ИЛИ НЕ ДанныеКомплектаСрезПоследних.Конструктор = ДанныеКомплектаСрезПоследних.Конструктор
		|				И Задачи_ПКД.ОбобщеннаяЗадача)";
	
	Запрос.УстановитьПараметр("мКомплекты", мКомплекты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектЗадача = Выборка.Задача.ПолучитьОбъект();
		ОбъектЗадача.ОбобщеннаяЗадача = НЕ ОбъектЗадача.ОбобщеннаяЗадача;
		
		ОбъектЗадача.ДополнительныеСвойства.Вставить("НеПроверятьОбобщеность", Истина);
		ОбъектЗадача.Записать();                                            	
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ПроверитьМассивКомпозиций(мКомпозиции, мОбработанныеКомпозиции)
	
	
	
КонецПроцедуры 
 
Процедура ПроверитьЕдинственнуюЗадачу(Задача)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ,
		|	Задачи_ПКД.Композиция КАК Композиция,
		|	Задачи_ПКД.ОбобщеннаяЗадача КАК ОбобщеннаяЗадача
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.Ссылка = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИзменитьОбобщение = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.ОбъектТЗ) = Тип("СправочникСсылка.Композиции") Тогда
			ИзменитьОбобщение = Выборка.ОбобщеннаяЗадача;
			мЗадачиКомплекты = ПолучитьПодчиненыеКомплекты(Выборка.ОбъектТЗ);
			мОбработанныеКомпозиции = Новый Массив;
			мОбработанныеКомпозиции.Добавить(Выборка.ОбъектТЗ);
			
			ПроверитьМассивЗадач(мЗадачиКомплекты, мОбработанныеКомпозиции);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.Композиция) Тогда
			ИзменитьОбобщение = Выборка.ОбобщеннаяЗадача;
		Иначе
			мКомплекты = Новый Массив(1);
			мКомплекты[0] = Выборка.ОбъектТЗ; 
			тзКонструкторы = ПолучитьКонстукторов(Выборка.Композиция, мКомплекты);
			
			Если тзКонструкторы.Количество() < 2 Тогда
				Возврат;	
			КонецЕсли;
			
			КонструкторКомпозиции 	= тзКонструкторы[0].Конструктор;
			КонструкторКомплекта	= тзКонструкторы[1].Конструктор;
			
			Если КонструкторКомплекта = КонструкторКомпозиции Тогда
				ИзменитьОбобщение = НЕ Выборка.ОбобщеннаяЗадача;
			Иначе
				ИзменитьОбобщение = Выборка.ОбобщеннаяЗадача;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИзменитьОбобщение Тогда
		
		ОбъектЗадача = Задача.ПолучитьОбъект();
		ОбъектЗадача.ОбобщеннаяЗадача = НЕ ОбъектЗадача.ОбобщеннаяЗадача;
		
		ОбъектЗадача.ДополнительныеСвойства.Вставить("НеПроверятьОбобщеность", Истина);
		ОбъектЗадача.Записать();                                            	
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ПолучитьПодчиненыеКомплекты(Композиция)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.Композиция = &Композиция
		|	И Задачи_ПКД.ОбъектТЗ <> &Композиция";
	
	Запрос.УстановитьПараметр("Композиция", Композиция);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьКонстукторов(Композиция, мКомплекты)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплекта.Комплект КАК Комплект,
		|	ДанныеКомплекта.Конструктор КАК Конструктор
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект В(&мКомплекты)";
	
	Запрос.УстановитьПараметр("мКомплекты", мКомплекты);
	Запрос.УстановитьПараметр("Композиция", Композиция);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьКонстукторов(Выборка.Композиция, мКомплекты)
